/*

P & NP
- 그 문제가 쉬운문제인지, 어려운문제인지, 해결법이 알려져 있는지를 판단하는 척도


결정문제 
- 어떤 문제가 주어졌을 때 true, false로 답을 할 수 있는 문제

최적화문제
- 어떠한 상황이 주어지고 해당 상황에서 최적의 해를 찾는 문제

P 문제
- 결정문제가 주어졌을 때 결정론적 튜링 머신을 사용해 다항 시간 내에 답을 구할 수 있는 문제

※ 결정론적 튜링 머신 : 현재 상태에서 다음 상태로 이동할 때 다음 상태가 유일하게 결정되는 머신
  -> 다음 상태가 유일한 상태로 해결하기 때문에 문제를 일방향으로 해결
  -> 컴퓨터 동작방식

※ 다항시간 : 문제를 해결하는데 걸리는 시간이 다항식으로 표현할 수 있는 것
           : 예를들어 a알고리즘 수행시간이 O(n^2)라면 해당 알고리즘은 다항시간내에 답을 구할 수 있는 알고리즘
           : 상수시간, 로그 시간등으로 풀수 있는 문제


           




P 문제

알고리즘을 성능을 표기할때 = Big-O 표기법을 사용



*/